String agreement = '''重要须知：
本《nCDN节点共享计划用户协议》（下称“本协议”）是用户与波川科技（北京）有限公司（下称“波川科技”）之间关于用户成为nCDN节点共享计划用户且使用nCDN节点共享计划服务（以下简称“本服务”）所订立的协议。本协议描述波川科技与用户之间关于nCDN节点共享计划使用及相关方面的权利义务。"用户"或"您"是指参与nCDN节点共享计划的个人或单一实体。“nCDN节点共享计划”是指用户通过波川科技接受的智能硬件产品和APP软件共享闲置宽带、存储、计算能力等资源以获取经济回报。波川科技针对用户有效共享的闲置宽带、存储、计算能力等资源，结合有效分享的在线时间，按照计算规则给用户发放回报。用户在此确认并同意，波川科技提供的回报是针对用户作出的有效共享，并非提供任何理财或与金融有关的产品或渠道、机会或方式，不等同或类似于任何投资理财形式。

波川科技在此特别提醒用户认真阅读本协议中各条款，包括免除或者限制波川科技责任的免责条款及对用户的权利限制。

请您审阅并接受或不接受本协议（未成年人应在法定监护人陪同下审阅和履行，未成年人行使和履行本协议项下的权利和义务视为其已获得了法定监护人的认可）。除非您接受本协议条款，否则您无权使用本协议项下的相关产品和服务。您的注册和使用行为将视为对本协议的接受，并同意接受本协议各项条款的约束。

1.协议的确认和接纳
1.1 本服务涉及到的波川科技相关软件的包括但不限于所有权、知识产权等一切权利归波川科技所有。波川科技所提供的本服务将按照本协议约定和波川科技不时发布的具体服务条款和操作规则严格执行。用户在享受本服务时，应当受本协议以及软件及服务相关的具体服务条款、操作规则、第三方软件及服务相应的用户协议（如有）的约束及其各自的最新版本（统称【服务条款】）的约束。
 
1.2 用户一经注册和/或登录成功，则本协议立即成立且生效，即表示用户自愿接受本协议及波川科技不时发布的服务条款的所有内容。为了避免歧义，波川科技通过APP和智能硬件向用户提供的本服务不包括【云添加、私人文件存储或下载】内容。

1.3 本服务涉及的APP、相关网站的著作权和运营权，以及共享计划制度和活动的发布和修改权均归波川科技所有。波川科技享有对用户网上一切活动的监督、提示、检查的权利，如用户的行为违反有关法律法规或违反本协议或服务条款的约定，波川科技享有要求其纠正及追究其责任等权利。

1.4 当用户使用本服务的单项服务时，对于这些服务可能有单独的服务条款或用户协议（如有）加以规范，请用户在使用有关服务时另行了解和确认，用户使用任一单项服务的行为视为其对该单项服务的服务条款或用户协议（如有）以及波川科技在该单项服务中发出的各类公告的同意。

1.5 当用户使用本服务提供的有关支付、交易等相关服务时，需依照法律法规要求，进行实名认证，并遵守法律法规和波川科技的政策规范，不得实施洗钱、欺诈等违法违规行为。

2.账号注册及使用
2.1 在您注册成功或以其他波川科技允许的方式实际使用波川科技本服务时，即获得波川科技规定用户所应享有的一切权限；在发生本协议约定的特定情形时，波川科技有权对其正式用户的权限设计进行变更。用户承诺在注册时所提供的个人身份资料信息真实、完整、准确、有效，并对所提供的信息承担相应的法律责任。如果因用户注册信息不真实、未及时更新信息导致波川科技无法按本协议约定向用户履行义务，由此产生的法律后果（包括用户在使用波川科技服务过程中因此遭受的损失或者给波川科技或其他第三方造成的损失）由用户自行承担，波川科技不负任何责任。

用户注册账号时不得存在以下情形，否则波川科技保留行使取消其用户资格的权利：

2.1.1 以党或国家领导人或其他社会名人的真实姓名、字号、艺名、笔名注册的；

2.1.2 以党或国家机构或其他机构的名称注册的；

2.1.3 以不文明、不健康或包含歧视、侮辱、猥亵等类似词语注册的；

2.1.4 以容易产生歧义、引起他人误解或其它不符合法律法规、规章制度等规定或违反公序良俗、可能侵犯第三人权益的内容注册的；

2.1.5 其他用户注册信息不适宜用于注册的情形。

2.2 波川科技账号及账号中所有虚拟物品（包括但不限于软件、技术、数据、代码、用户操作界面等，但用户账户内的工作量证明以及用户以各种形式上载、存储、分享的内容除外）的所有权归波川科技所有。用户完成申请注册手续后，获得波川科技账号的有限使用权。用户对其所持账号项下发生的一切操作行为依法享有权利和承担责任。

2.3 波川科技账号使用权仅属于初始申请注册人，禁止赠与、借用、租用、转让、共享、委托或售卖等将账号交他人使用的行为。如果波川科技发现使用者并非账号初始注册人，波川科技有权在未经通知的情况下回收该账号而无需向该账号使用人承担法律责任，由此带来的包括并不限于用户资料等清空等损失由用户自行承担。用户应当自行承担因违反此要求而遭致的任何损失，同时波川科技保留追究用户及用户账号实际使用人法律责任的权利。

2.4 用户承担波川科技账号与密码的保管责任，并就其账号及密码项下之一切活动负全部责任。用户须重视波川科技账号的密码保护。用户同意如发现他人未经许可使用其账号时立即通知波川科技，并有权通知波川科技采取措施暂停该账号的登录和使用。

2.5 波川科技根据用户的通知采取措施暂停用户账号的登录和使用的，波川科技可要求用户提供并核实与其注册身份信息相一致的个人有效身份信息。

2.5.1 波川科技核实用户所提供的个人有效身份信息与注册时所使用的身份信息相一致的，应当及时采取措施暂停用户账号的登录和使用。

2.5.2 用户没有提供其个人有效身份证件或者用户提供的个人有效身份证件与注册时所使用的身份信息不一致的，波川科技有权拒绝用户上述请求。

2.6 用户为了维护其合法权益，向波川科技提供与注册时所使用的身份信息相一致的个人有效身份信息时，波川科技可视实际情况决定其是否为用户提供账号注册人证明、原始注册信息等必要的协助和支持，并根据需要向有关行政机关和司法机关提供相关证据信息资料。

2.7 用户在丢失或遗忘波川科技账号的密码后，须遵照波川科技公布的申诉途径及时申诉并请求找回账号。用户应不断提供能增加账号安全性的个人密码保护资料。用户可以凭初始注册资料及个人密码保护资料填写申诉单向波川科技申请找回账号，波川科技的密码找回机制仅负责识别申诉单上所填资料与系统记录资料的表面一致性，而无法识别申诉人是否系真正账号使用权人。用户知晓波川科技账号及密码保管责任在于用户本人，波川科技账号丢失或遗忘密码后用户不一定能通过波川科技申诉制度找回账号。对用户因被他人冒名申诉而致的任何损失，波川科技不承担任何责任。

2.8 本着有效利用波川科技账号资源，保障更多合法用户权益为目的，用户恶意注册波川科技账号或注册后六个月未登录或不使用且未绑定设备的账号，波川科技有权回收，以免造成资源浪费，由此带来的损失由用户自行承担。

2.9 波川科技有权审查用户注册所提供的身份信息是否真实、有效，并应积极地采取技术与管理等合理措施保障用户账号的安全、有效；用户有义务妥善保管其账号及密码，并正确、安全地使用其账号及密码。任何一方未尽上述义务导致账号密码遗失、账号被盗等情形而给用户和他人的民事权利造成损害的，应当承担由此产生的法律责任。

2.10 您可以通过波川科技提供的或允许的方式提交账户注销申请。在您成功注销账户之后，我们将停止为您提供服务，并根据适用法律的要求删除您的个人信息，或对其进行匿名化处理。

3.用户守则

3.1 波川科技提供的本服务服务可能包含部分收费服务项目。用户使用收费服务项目时需要向波川科技支付一定的费用。对于收费的服务项目，波川科技会在用户使用之前给予用户明确的提示，只有用户根据波川科技相关提示实际支付相关费用，用户才能使用该等收费服务项目。如果用户拒绝支付相关费用，则波川科技有权不向用户提供该等收费服务项目。

3.2 用户理解，波川科技仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费及流量费）均应由用户自行负担。

3.3 用户不得利用波川科技软件及服务误导、欺骗他人。

3.4 用户须对自己在使用本服务过程中的行为承担法律责任。用户承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在波川科技首先承担了因用户行为导致的行政处罚或对他人损害赔偿责任后，用户应给予波川科技等额的全面赔偿。

3.5 用户在遵守法律法规及本协议的前提下可依本协议使用本服务，用户无权实施包括但不限于下列行为：

3.5.1 删除波川科技软件及其他副本上所有关于版权的信息、内容；

3.5.2 对波川科技软件进行反向工程、反向汇编、反向编译等；

3.5.3 对于波川科技软件相关信息等，未经波川科技书面同意，用户不得擅自实施包括但不限于下列行为：使用、复制、修改、链接、转载、汇编、发表、出版，建立镜像站点、擅自借助波川科技软件发展与之有关的衍生产品、作品、服务等。

3.5.4 对于本服务中的APP和配套智能硬件，用户不得擅自实施包括但不限于下列行为：复制、修改、破解、删除、反向工程及未经波川科技允许的再次售卖等。

3.5.5 任何利用软件、硬件等相关漏洞，侵入、拦截、破坏、修改程序的用户，以及使用带有伪造、篡改相关功能信息的软/硬件，虚假上报上行带宽、闲置存储空间、在线时长、硬件能力等信息的用户，波川科技有权对用户予以一日、数日或永久封停违规账号和违规设备、终止回报发放、扣除待发放回报、要求退回已发放的回报等处罚。情况严重的，我们将在适时向有关司法行政机构举报。

3.6 用户在使用本服务时必须符合中国有关法规以及其他有关国家和地区的法律规定以及国际法的有关规定。用户不得利用本服务和本服务相关产品制作、发表、复制、传送、传播、储存以下信息：
3.6.1 违反宪法确定的基本原则的；
3.6.2 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
3.6.3 损害国家荣誉和利益的；
3.6.4 煽动民族仇恨、民族歧视，破坏民族团结的；
3.6.5 破坏国家宗教政策，宣扬邪教和封建迷信的；
3.6.6 散布谣言，扰乱社会秩序，破坏社会稳定的；
3.6.7 散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；
3.6.8 侮辱或者诽谤他人，侵害他人合法权益的；
3.6.9 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；
3.6.10 以非法民间组织名义活动的；
3.6.11 侵犯他人知识产权、商业秘密或其他合法权利的；
3.6.12 含有法律、行政法规禁止的其他内容的。

3.7 用户不得以任何方式干扰波川科技的服务。

3.8 用户不得进行任何危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器/账户；未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；未经许可，企图探查、扫描、测试官方软件系统或网络的弱点或其它实施破坏网络安全的行为；企图干涉、破坏官方软件系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造TCP/IP数据包名称或部分名称。

3.9 用户不得利用本服务和本服务相关产品从事以下任一活动：
3.9.1 未经允许，进入计算机信息网络或者使用计算机信息网络资源的；
3.9.2 未经允许，对计算机信息网络功能进行删除、修改或者增加的；
3.9.3 未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；
3.9.4 故意制作、传播计算机病毒等破坏性程序的；
3.9.5 其他危害计算机信息网络安全的行为。
3.10 用户使用波川科技电子公告服务包括但不限于电子布告牌、电子白板、电子论坛、网络聊天室和留言板等以交互形式为上网用户提供信息发布服务的行为，也须遵守本协议的规定以及波川科技已经或将来专门发布的电子公告服务规则，否则波川科技有权基于独立判断立即封停用户服务账号。
3.11 非经波川科技或波川科技授权开发并正式发布的其它任何由波川科技软件衍生的软件均属非法，下载、安装、使用此类软件，将可能导致不可预知的风险，由此产生的一切法律责任与纠纷一概与波川科技无关。用户不得轻易下载、安装、使用此类软件，否则，波川科技有权在不事先通知用户的情况下单方面终止用户波川科技账号的使用资格。
3.12 本服务可能包含为用户提供的信息存储空间、计算能力分享、数据备份等服务。用户充分理解并接受，波川科技不会且无法在用户利用本服务存储、分享、向其他设备传输数据的过程中下载、查看、修改用户上传、存储的数据，也不为用户所上传、存储数据在存储、分享、传输过程中的毁损、灭失承担风险与法律责任。

4.服务规范
4.1 用户通过使用波川科技接受的智能硬件及“APP”参与共享计划获取回报。波川科技针对用户所有效共享的闲置宽带、存储、计算能力等资源，结合有效分享的在线时间，按照计算规则给用户发放回报。具体的计算及发放规则、回报模式等请参见相关页面信息。用户使用本服务视为接受同意波川科技的回报模式，及其不时发布或更新的回报计算及发放规则。

4.2 用户理解并同意本服务在给予回报的同时会产生一定的税费，基于回报的税费由用户自行承担，我们有权自行或委托第三方代扣代缴。

4.3 用户明确同意使用本服务所产生的风险由用户个人承担。波川科技明确表示不提供任何类型的担保，不论是明示的或默示的，包括但不限于适销性、适用性、可靠性、准确性、完整性、无病毒以及无错误的任何默示保证和责任。波川科技不担保所提供的服务或回报一定能满足协议的约定，也不担保回报模式不会受中断，对回报的及时性、安全性、可能出错都不作担保。用户理解并接受通过共享计算资源获取回报的模式可能存在的风险，并由其承担系统受损、资料丢失以及其它任何风险。对在任何情况下因使用本服务所产生的直接、间接、偶然、特殊及后续的损害及风险，波川科技及／或其关联公司、合作单位不承担任何责任。

4.4 用户同意并理解，本服务的回报模式可能因共享计算生态环境变化、法律政策变化、参与用户数量变化等非波川科技可预见的因素或不可抗力等因素影响而变更、中止甚至终止；在发生上述情况时，波川科技不承担任何责任。

4.5 任何用户不得利用软件、硬件等相关漏洞，侵入、拦截、破坏、修改程序以及使用带有伪造、篡改相关功能信息的软/硬件，虚假上报上行带宽、闲置存储空间、在线时长、硬件能力等数据，否则波川科技有权对用户予以一日、数日或永久封停违规账号和违规设备、终止回报发放、扣除待发放回报、要求退回已发放的回报等处罚。

5.法律责任及免责
5.1 用户明确同意使用本服务所产生的风险由用户个人承担。波川科技明确表示不提供任何类型的担保，不论是明示的或默示的，包括但不限于适销性、适用性、可靠性、准确性、完整性、无病毒以及无错误的任何默示保证和责任。波川科技不担保服务一定能满足用户的要求，也不担保服务不会受中断，对服务的及时性、安全性、可能出错都不作担保。用户理解并接受下载或通过本服务取得的任何信息资料为用户自主行为，并由其承担系统受损、资料丢失以及其它任何风险。对在任何情况下因使用或不能使用波川科技服务所产生的直接、间接、偶然、特殊及后续的损害及风险，波川科技及合作单位不承担任何责任。

5.2 波川科技对波川科技账号上所有服务将尽力维护其安全性及方便性，但对服务中出现的信息（包括但不限于用户发布的信息）删除或储存失败不承担任何责任。波川科技保留判定用户的行为是否符合本协议约定的权利，如果用户违背了本协议规定，波川科技有权暂停对该用户的波川科技账号服务。

5.3 用户应该基于自己的判断来选择电信业务运营商及相关服务，确认自己是否获得电信业务运营商的许可，有权利进行本协议项下的全部合作或服务，如因电信业务运营商等第三方方面的原因，导致用户无权或不能进行本协议项下合作和服务，及任何法律责任或相关服务不能履行、履行瑕疵等不利后果，波川科技不予负责和承担。

5.4 本服务因涉及到互联网服务，可能会受到各个环节不稳定因素的影响，存在因不可抗力、计算机病毒、黑客攻击、其他用户恶意访问、系统不稳定、用户所在位置、用户关机以及其他任何网络、技术、通信线路等原因造成的服务中断或错误等不能满足用户要求的风险，用户认可并自行承担以上风险以及因使用局域网等不受信任的网络环境而给用户造成（或声称造成）的任何直接或间接损失，波川科技不承担任何责任。

5.5 用户因电信业务运营商等部门等第三方的通讯线路故障、技术问题、网络、电脑故障、系统不稳定性及其他各种不可抗力原因而遭受的经济损失，波川科技不承担任何责任。

5.6 因电信业务运营商等部门的第三方技术问题及其他不可抗力原因影响到本服务的正常运行的，波川科技承诺在第一时间内与相关单位配合，及时处理进行修复，但用户因此而遭受的经济损失，波川科技不承担任何责任。

5.7 用户违反本协议或相关的服务条款的规定，因此产生的任何第三方主张的任何索赔、要求或损失，包括合理的诉讼费用和律师费用，您同意赔偿波川科技与合作公司、关联公司，并使之免受损害。对此，波川科技有权视用户的行为性质，采取包括但不限于暂停账号使用、停止提供服务、限制使用、法律追究等措施。

5.8 因用户侵犯其他用户或者其他第三方权益导致波川科技被起诉的情形下，波川科技可基于独立判断向法院提供该用户信息。

6.第三方服务
用户理解并同意：

6.1 为提供您所要求的产品和服务，波川科技仅向第三方服务提供用户的相关信息；因与第三方支付合作需填写的银行卡等信息为本人自愿。如因第三方提供的服务导致用户遭受任何损失或者用户与第三方发生纠纷的，用户与第三方自行解决。

6.2 尽管波川科技对第三方进行了严格的甄选，但不能控制或保证第三方全部信息的真实性、合法性、准确性，亦不能控制或保证第三方所涉及产品或服务的质量、服务能力及持续性，以及第三方履行在相应服务协议项下的各项义务的能力。

6.3 由于第三方所提供产品或服务出现质量瑕疵、服务迟延或中断而导致用户任何损失的，波川科技对因此造成的后果不承担任何责任。

6.4 波川科技所提供涉及第三方服务的信息随时都有可能发生变动，对此波川科技不作特别通知。另外由于第三方通过波川科技提供服务的信息数量会不断增多，极其庞大，虽然波川科技会尽最大努力保证用户所浏览信息的准确性，但由于互联网技术因素等客观原因存在，波川科技网页显示的信息可能会有一定的滞后性或差错，用户对此予以理解和认可。

6.5 波川科技并不控制链接网站及其内容，对于由第三方所有、控制或运营的网站的内容，波川科技不对其真实性、可靠性、合法性及有效性负责。对于该等内容或链接，用户应自行判断风险，对于任何因使用或信赖链接网站或资源上的内容而给用户造成（或声称造成）的任何直接或间接损失，波川科技不承担任何责任。

7.用户协议的变更与修订
7.1 波川科技有权在必要时单方修改本协议约定以及各单项服务的相关条款。波川科技对本协议及/或各单项服务相关条款的修改自其线上公示或以各种形式通知或系统升级提示之日自动生效。用户在享受服务时，应当及时查阅了解修改的内容，并自觉遵守本协议约定以及该单项服务的相关条款；用户不同意修改内容的，应当立即停止继续使用波川科技的服务。

7.2 波川科技保留随时修改或中断服务而不另行通知用户的权利。用户接受波川科技行使修改或中断服务的权利，波川科技不需就此对用户或第三方负责。

8.隐私权政策
8.1 尊重用户个人隐私是波川科技的一项基本政策。波川科技会采取必要措施保护用户的个人信息资料的安全。APP及本服务的特点导致波川科技无法并且不会以任何方式保存、存储用户上传、存储的数据，且波川科技在未经用户的授权时不得公开、修改其注册资料及上传、存储在波川科技各项服务中的非公开内容，除非波川科技在诚信的基础上认为透露这些信息在以下几种情况是必要的则可以无需用户另行授权进行公开、修改：
8.1.1 用户或用户监护人授权波川科技披露的；
8.1.2 有关法律要求波川科技披露的；
8.1.3 司法机关或行政机关基于法定程序要求波川科技提供的；
8.1.4 波川科技为了维护自己合法权益而向用户提起诉讼或者仲裁时；
8.1.5 应用户监护人的合法要求而提供用户个人身份信息时；
8.1.6 保持维护波川科技的知识产权和其他重要权利时；
8.1.7 在紧急情况下竭力维护用户个人和社会大众的隐私安全；
8.1.8 根据本条款相关规定或者波川科技认为必要的其他情况下。

8.2 除用户与波川科技及合作单位之间就用户个人隐私信息公开或使用另有约定的除外，用户应自行承担本协议第8.1条款项下用户个人隐私信息公开而可能产生的任何风险，波川科技对此不予负责。

8.3 用户同意个人隐私信息是指那些能够对用户进行个人辨识或涉及个人通信的信息，包括下列信息：用户的姓名，身份证号，手机号码，IP地址，电子邮件、联系方式、家庭地址等信息。而非个人隐私信息是指用户对本软件的操作状态以及使用习惯等一些明确且客观反映在波川科技服务器端的基本记录信息和其他一切个人隐私信息范围外的普通信息。

8.4 一般而言，波川科技基于下列原因需要使用到用户的信息资源：

8.4.1 执行软件验证服务;
8.4.2 执行硬件、软件升级服务，检测设备状态;

8.4.3 网络同步服务;

8.4.4 提高用户的使用安全性并提供客户支持;

8.4.5 因用户使用波川科技或波川科技合作的第三方提供特定服务时，波川科技或第三方则需要把用户的信息提供给与此相关联的各方;

8.4.6 执行波川科技在本协议中的隐私保护条款；

8.4.7 因用户侵犯其他用户或者其他第三方权益导致波川科技被起诉的情形下，波川科技可基于独立判断向法院提供该用户信息；

8.4.8 其他有利于用户和波川科技利益的。

8.5 在不透露单个用户隐私资料的前提下，波川科技有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。

9.未成年人隐私权的保护
9.1 波川科技将建立和维持合理的程序，以保护未成年人个人资料的保密性及安全性。波川科技郑重声明：任何18岁以下的未成年人参加网上活动应事先得到家长或其法定监护人（以下统称为"监护人"）的可经查证的同意。

9.2 监护人应承担保护未成年人在网络环境下的隐私权的首要责任。

9.3 未经监护人之同意，波川科技将不会使用未成年人之个人资料，亦不会向任何第三方披露或传送可识别该未成人的个人资料，但是，由于相关法律法规要求、国家机关的查询要求、或在紧急情况下竭力维护用户个人和社会大众的隐私安全等原因除外。

9.4 波川科技收集未成年人的个人资料，这些资料只是单纯作为保护未成年人参与网络活动时的安全，而非作为其它目的之利用。波川科技保证不会要求未成年人提供额外的个人资料，以作为允许其参与网上活动的条件。

10.青少年用户特别提示

10.1 青少年用户必须遵守全国青少年网络文明公约，青少年用户在参与网络活动中注意以下事项，正确学习使用网络，加强自我保护：

10.2 青少年用户要注意区分网络与现实的区别，避免沉迷于网络而影响了日常的学习生活。

10.3 青少年用户填写个人资料时，加强个人保护意识，以免不良分子对个人生活造成骚扰。

10.4 未满18周岁青少年应在监护人指导和监督下上网。青少年用户要善于网上学习，不浏览不良信息，要诚实友好交流，不侮辱欺诈他人。

10.5 青少年用户应增强自我保护意识，避免陌生网友会面或参与联谊活动，以免为不法分子所乘，危及自身。

10.6 青少年用户要维护网络安全，不破坏网络秩序；如有违法行为，波川科技保留配合公安或运营商部门追查的权利。波川科技郑重提醒用户正确认识网络世界，重视参加网络活动的安全性，加强防范，确保安全。

11.服务中止与终止
11.1 用户如有发布违法信息、严重违背社会公德以及其他违反法律法规、规章及监管政策禁止性规定、违反本协议约定的行为，波川科技有权立即终止提供服务。

11.2 用户在接受波川科技服务时实施不正当行为的，波川科技有权终止对用户提供服务。

11.3 用户提供虚假注册身份信息，或实施违反本协议的行为，波川科技有权中止对用户提供全部或部分服务。

11.4 波川科技保留随时变更、中断或终止服务而不需另行通知用户的权利。用户接受波川科技行使变更、中断或终止服务的权利，波川科技不需就此对用户或第三方承担任何形式的赔偿或补偿责任。

11.5 因法律法规、监管政策、电信业务运营商、第三方技术问题及其他不可抗力原因导致波川科技终止或中止服务的，波川科技完成告知义务后，无需就此对用户或第三方承担任何形式的赔偿或补偿责任。

12.知识产权
12.1 波川科技用户上载、存储或分享的所有内容并不反应亦不代表任何波川科技之意见。波川科技无法并且不会控制或改变用户的上载、存储、分享行为及其任何内容，波川科技不知道也没有合理理由应当知道并保证上载、存储、分享内容真实、合法、完整、有效。波川科技也不通过用户的上载、存储、分享行为获取任何经济利益。如果用户上载的内容允许其他用户搜索、下载、查看、收听或以其他方式访问或分发，则用户必须保证，其上载、存储、分享或通过其他方式传播的内容已从相关权利人处出获得相应书面授权，保证对该内容拥有充分和完整的所有权和知识产权，保证其上载、分享的行为及其内容符合国家相关法律法规规定，并且不侵犯任何第三方合法权益，否则用户应当承担全部法律责任并使波川科技免责。

13.法律适用和管辖
13.1 本协议所定的任何条款的部分或全部无效者，不影响其它条款的效力。
13.2 本协议的生效、履行、解释及争议的解决均适用中华人民共和国法律。
13.3 凡因本协议引起的或与本协议有关的任何争议，均应提交波川科技所在地有管辖权的法院解决，对各方具有约束力。

 ''';
